Revit 2027 API
BuiltInFailures.FaceSplitterFailures.CannotUseCurvesForFaceSplit Property
 The sketch cannot split the face of the highlighted element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotUseCurvesForFaceSplit { get; }
Public Shared ReadOnly Property CannotUseCurvesForFaceSplit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotUseCurvesForFaceSplit {
	FailureDefinitionId^ get ();
}
static member CannotUseCurvesForFaceSplit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FaceSplitterFailures Class
Autodesk.Revit.DB Namespace